/*
המשימה:נתון מערך ממוין של מספרים שלמים (הכולל מספרים שליליים וחיוביים).
עליך להחזיר מערך חדש המכיל את אותם המספרים המקוריים, אבל הפעם הם צריכים להיות ממוינים לפי הערך המוחלט שלהם בסדר עולה (מהקטן לגדול).(תזכורת: ערך מוחלט הוא המרחק של המספר מ-0. כלומר, הערך המוחלט של 5- הוא 5, והערך המוחלט של 4 הוא 4. ב-JavaScript משתמשים בפונקציה Math.abs(num) כדי לקבל ערך מוחלט).אילוצים:אסור להשתמש בפונקציות מיון מובנות (sort).יש לפתור במעבר אחד (סיבוכיות $O(n)$) – כלומר לבנות את המערך בעזרת מצביע ימני ומצביע שמאלי, בדיוק כמו בשאלה של הריבועים.

// Input:  [-8, -5, -1, 0, 2, 4]  
// Output: [0, -1, 2, 4, -5, -8]
//
// הסבר: הערכים המוחלטים של המערך הם [8, 5, 1, 0, 2, 4].
// אם נמיין את הערכים המוחלטים נקבל: [0, 1, 2, 4, 5, 8].
// המספרים המקוריים שמתאימים להם הם התשובה שלנו.


*/
function f1(arr) {

    let result = new Array(arr.length); //יצירת מערך 
    let L = 0 ;
    let R = arr.length - 1 ;
    let insertPos = arr.length - 1; // מתחילים למלא מהסוף

    
   while( L <= R){

    //let curMax = Math.abs(arr[L]);
    let curR = Math.abs(arr[R]);
    let curL = Math.abs(arr[L]);

    if( curL > curR){
        result[insertPos] = arr[L];
        L++;
    }
    else {
        result[insertPos] = arr[R];
        R--;
    }
    insertPos--;
   }
    return result
}

// בדיקות (להריץ בטרמינל)
console.log("Output :", f1([-8, -5, -1, 0, 2, 4])); 
// צפי: [0, -1, 2, 4, -5, -8]

console.log("Output :", f1([-3, -2, -1, 1, 2])); 
// צפי: [-1, 1, -2, 2, -3] (או [1, -1, 2, -2, -3] במקרה של שוויון, שניהם תקינים)
